@extends('frontend.layouts.master')
@section('title', $data['title'] ?? 'Home')
@section('content')

    <!-- START HERO -->
    <section class="hero-section">
        <div class="container">
            <div class="row">
                <div class="col-lg-8 col-12 mx-auto mt-3">
                    <h1 class="text-center title">أهـــل سـوريا</h1>
                    <p class="text-center subtitle">نتخطى الحدود للوصول إلى خدمات صحية أفضل</p>

                    <form action="{{ route('frontend.search') }}"
                        class="custom-form mt-4 pt-2 mb-lg-0 mb-5 justify-content-center" role="search">
                        <div class="row">
                            <div class="col-12 col-md-9 mb-3 mb-md-0">
                                <div class="input-group input-group-lg box-input">
                                    <span for="keyword" class="input-group-text bi-search input-icon"
                                        id="basic-addon1"></span>
                                    <input name="query" type="search" class="form-control" id="keyword"
                                        placeholder="ابحث عن مقالات و تدربيات و غيرها" value="{{ @$_GET['query'] }}"
                                        aria-label="Search" autocomplete="on">
                                </div>
                            </div>
                            <div class="col-12 col-md-3 d-flex justify-content-center button">
                                <button type="submit" class="custom-button">بحث</button>
                            </div>
                        </div>
                    </form>
                </div>
            </div>
        </div>
    </section>
    <!-- END HERO -->

    <!-- START TOPICS -->
    <section class="featured-section">
        <div class="container">
            <div class="row justify-content-center">
                <div class="custom-img custom-block-overlay blur-img">
                    <div class="d-flex flex-column h-100">


                        <img src={{ url('frontend/assets/images/cover.png') }}
                            class="custom-block-image img-fluid original-size" alt="">
                    </div>
                </div>
            </div>
        </div>
    </section>
    <!-- END TOPICS -->

    <!-- START FAQ -->
    <section class="faq-section mb-5">
        <div class="container">
            <div class="row">
                <div class="col-lg-7 col-12">
                    <div class="box-title">
                        <h2>من نحن</h2>
                        <p class="p-faq">
                            أهل سوريا هي منصة تعليمية الكترونية أشرف على إنشائها وتطويرها فريق عمل سوري ليستفيد منها مزودو
                            الرعاية الصحية السوريون حول العالم. تهدف إلى جمع مزودي الرعاية الطبية السوريين على اختلاف
                            اختصاصاتهم في مكان واحد بهدف تسهيل عملية التواصل وتبادل الخبرات الطبية ولإتاحة فرصة الاستفادة من
                            محتوى علمي نوعي يجمع ما بين آخر المستجدات في المجالات الطبية وواقع القطاع الصحي في سوريا. حلمنا
                            أن نكون سبباً في إرساء لبنة تطوير للعمل الطبي بهدف تحسين مستوى الرعاية الطبية المقدمة للسوريين
                            أينما كانوا.</p>
                    </div>
                </div>
                <div class="col-lg-5 col-12 d-flex align-items-center justify-content-center">
                    <img src={{ url('frontend/assets/images/Who_we_are.png') }} class="img-fluid" alt="FAQs">
                </div>
            </div>
        </div>
    </section>
    <!-- END FAQ -->

    <!-- START explore -->
    <section class="pt-5 pb-3">
        <div class="container">
            <div class="row">
                <div class="col-12 ">
                    <div class="row ">
                        <div class="col-12 text-center">
                            <h2 class="mb-5 title2">مهمتنا و رؤيتنا</h2>
                        </div>
                        <!-- Adjusted column classes for responsiveness -->
                        <div
                            class="col-lg-4 col-md-12 col-12 mb-4 mb-lg-0 d-flex justify-content-center align-items-center">
                            <div class="custom-block ">
                                <a>
                                    <div class="d-flex justify-content-center align-items-center">
                                        <div class="text-center">
                                            <div class="mb-4">
                                                <svg width="77" height="77" viewBox="0 0 77 77" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M56.0859 0.53125C69.0894 0.53125 76.4303 7.90664 76.4686 20.9101V56.6209C76.4686 69.6206 69.0894 76.9998 56.0859 76.9998H20.3789C7.37539 76.9998 0 69.6206 0 56.6209V20.9101C0 7.90664 7.37539 0.53125 20.3789 0.53125H56.0859ZM40.146 16.322C39.0716 15.672 37.7717 15.672 36.7431 16.322C35.707 16.9682 35.1373 18.1573 35.2482 19.3425V58.3033C35.4432 59.9473 36.8158 61.1708 38.4216 61.1708C40.0695 61.1708 41.4421 59.9473 41.5951 58.3033V19.3425C41.748 18.1573 41.1783 16.9682 40.146 16.322ZM22.2906 28.8629C21.2583 28.2129 19.9545 28.2129 18.926 28.8629C17.8898 29.5128 17.3201 30.6943 17.4348 31.8834V58.3033C17.5839 59.9473 18.9604 61.1708 20.6045 61.1708C22.2524 61.1708 23.625 59.9473 23.7779 58.3033V31.8834C23.8964 30.6943 23.3191 29.5128 22.2906 28.8629ZM57.6917 42.7419C56.6632 42.0919 55.3632 42.0919 54.2927 42.7419C53.2565 43.3919 52.6868 44.5351 52.8398 45.7624V58.3033C52.9927 59.9473 54.3653 61.1708 56.0132 61.1708C57.6191 61.1708 58.9917 59.9473 59.1867 58.3033V45.7624C59.2976 44.5351 58.7279 43.3919 57.6917 42.7419Z"
                                                        class="svg-path" />
                                                </svg>
                                            </div>
                                            <h3 class="mb-5 title-custom">تمكين الكوادر</h3>
                                            <p class="mb-2 custom-text-style">نسعى لتقديم الدعم الكامل للكوادر الصحية
                                                السورية من خلال
                                                تأمين الوصول إلى أحدث الموارد الطبية والعلمية. نهدف إلى تعزيز المهارات
                                                وتطوير القدرات،
                                                لضمان تقديم أفضل مستوى رعاية صحية لكل مريض سوري أينما كان.</p>
                                        </div>
                                    </div>
                                </a>
                            </div>
                        </div>
                        <div
                            class="col-lg-4 col-md-12 col-12 mb-4 mb-lg-0 d-flex justify-content-center align-items-center">
                            <div class="custom-block">
                                <a>
                                    <div class="d-flex justify-content-center align-items-center">
                                        <div class="text-center">
                                            <div class="mb-4">
                                                <svg width="88" height="79" viewBox="0 0 88 79" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path fill-rule="evenodd" clip-rule="evenodd"
                                                        d="M31.5894 0C14.1431 0 0 14.1431 0 31.5894C0 70.8037 52.2858 78.4288 52.2858 78.4288V63.1787H55.5537C73 63.1787 87.1431 49.0356 87.1431 31.5894C87.1431 14.1431 73 0 55.5537 0H31.5894ZM43.5715 38.1251C46.5795 38.1251 49.018 35.6866 49.018 32.6786C49.018 29.6707 46.5795 27.2322 43.5715 27.2322C40.5636 27.2322 38.1251 29.6707 38.1251 32.6786C38.1251 35.6866 40.5636 38.1251 43.5715 38.1251ZM66.4466 32.6786C66.4466 35.6866 64.0081 38.1251 61.0001 38.1251C57.9922 38.1251 55.5537 35.6866 55.5537 32.6786C55.5537 29.6707 57.9922 27.2322 61.0001 27.2322C64.0081 27.2322 66.4466 29.6707 66.4466 32.6786ZM26.1429 38.1251C29.1509 38.1251 31.5894 35.6866 31.5894 32.6786C31.5894 29.6707 29.1509 27.2322 26.1429 27.2322C23.135 27.2322 20.6965 29.6707 20.6965 32.6786C20.6965 35.6866 23.135 38.1251 26.1429 38.1251Z"
                                                        class="svg-path" />
                                                </svg>
                                            </div>
                                            <h3 class="mb-5 title-custom">خلق بيئة تواصل</h3>
                                            <p class="mb-2 custom-text-style">نوفر بيئة تفاعلية آمنة تتيح لمزودي الرعاية
                                                الصحية في سوريا
                                                فرصة تبادل الخبرات والمعرفة. من خلال التواصل المستمر، نسهم في تحسين الجودة
                                                المهنية وتعزيز
                                                العلاقات بين مقدمي الرعاية الصحية من مختلف أنحاء العالم.</p>
                                        </div>
                                    </div>
                                </a>
                            </div>
                        </div>
                        <div
                            class="col-lg-4 col-md-12 col-12 mb-4 mb-lg-0 d-flex justify-content-center align-items-center">
                            <div class="custom-block">
                                <a>
                                    <div class="d-flex justify-content-center align-items-center">
                                        <div class="text-center">
                                            <div class="mb-4">
                                                <svg width="77" height="77" viewBox="0 0 77 77" fill="none"
                                                    xmlns="http://www.w3.org/2000/svg">
                                                    <path
                                                        d="M51.4251 7.33712C51.2722 8.29298 51.1957 9.24884 51.1957 10.2047C51.1957 18.8074 58.1543 25.7622 66.7188 25.7622C67.6747 25.7622 68.5923 25.6513 69.5482 25.4984V56.3497C69.5482 69.3149 61.9013 77 48.9016 77H20.6503C7.64686 77 0 69.3149 0 56.3497V28.0601C0 15.0604 7.64686 7.33712 20.6503 7.33712H51.4251ZM52.1936 30.5836C51.1575 30.4689 50.129 30.9277 49.5134 31.7688L40.2645 43.7362L29.6698 35.4011C29.0198 34.904 28.2551 34.709 27.4904 34.7893C26.7296 34.904 26.0414 35.3208 25.5787 35.9325L14.2652 50.6566L14.032 51.0007C13.382 52.2204 13.6879 53.788 14.8349 54.6329C15.3702 54.977 15.9437 55.2064 16.5937 55.2064C17.4769 55.2447 18.3142 54.7821 18.8495 54.0594L28.4463 41.7059L39.3431 49.8919L39.6872 50.1175C40.9107 50.7674 42.4401 50.4654 43.3194 49.3145L54.3691 35.057L54.2162 35.1334C54.828 34.2923 54.9427 33.2217 54.5221 32.2659C54.1053 31.31 53.1839 30.66 52.1936 30.5836ZM67.2545 0.530273C72.3396 0.530273 76.4689 4.65958 76.4689 9.74474C76.4689 14.8299 72.3396 18.9592 67.2545 18.9592C62.1693 18.9592 58.04 14.8299 58.04 9.74474C58.04 4.65958 62.1693 0.530273 67.2545 0.530273Z"
                                                        class="svg-path" />
                                                </svg>
                                            </div>
                                            <h3 class="mb-5 title-custom">مستقبل طبي مزدهر</h3>
                                            <p class="mb-2 custom-text-style">من خلال منصة أهل سوريا، نطمح إلى خلق مجتمع
                                                تعليمي طبي
                                                مزدهر يكون مصدر إلهام وتطوير. رؤيتنا هي تقديم أفضل رعاية صحية ممكنة في
                                                سوريا، وجعل هذه
                                                الرؤية هدفًا جماعيًا لكل عضو في المنصة.</p>
                                        </div>
                                    </div>
                                </a>
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>
    <!-- END explore -->

    <!-- START values-->
    <section class="mt-5 mb-5">
        <div class="container">
            <div class="row d-flex align-items-center justify-content-center">
                <div class="col-12 text-center mt-5 box-title2">
                    <h2 class="mb-5 title2">القيم التي نؤمن بها</h2>
                </div>
                <div class="col-lg-7 col-12 mb-4 box-values1">
                    <div class="row box-values">
                        <div class="col-lg-6 col-md-6 col-12 values">
                            <div class="value">
                                <div class="mb-3">
                                    <svg width="35" height="35" viewBox="0 0 27 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.1842 7.65602L21.418 1.09602C21.213 0.839766 20.9055 0.634766 20.5467 0.634766H5.88921C5.53047 0.634766 5.22297 0.788516 5.01797 1.09602L0.251715 7.65602C-0.055785 8.06602 -0.00453502 8.62977 0.354215 8.98852L12.4492 22.006C12.6542 22.211 12.9105 22.3648 13.218 22.3648C13.5255 22.3648 13.7817 22.2623 13.9867 22.006L26.0817 8.98852C26.4405 8.62977 26.4917 8.06602 26.1842 7.65602ZM8.09297 9.34727L10.6555 16.9835L3.58297 9.34727H8.09297ZM14.1917 2.78727L15.9855 7.24602H10.4505L12.2442 2.78727H14.1917ZM16.088 9.34727L13.218 17.9573L10.348 9.34727H16.088ZM18.343 9.34727H22.853L15.7805 16.9835L18.343 9.34727ZM23.2117 7.19477H18.2917L16.498 2.78727H19.983L23.2117 7.19477ZM6.40172 2.78727H9.88671L8.09297 7.24602H3.22422L6.40172 2.78727Z"
                                            class="svg-path" />
                                    </svg>
                                </div>
                                <h4>الأمان</h4>
                                <p>أن نسعى لخلق بيئة آمنة تتيح لجميع مزودي الرعاية الصحية السوريين المشاركة بشكل فعال لتحقيق
                                    أقصى درجات
                                    الفائدة</p>
                            </div>
                            <div class="value">
                                <div class="mb-3">
                                    <svg width="35" height="35" viewBox="0 0 27 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.1842 7.65602L21.418 1.09602C21.213 0.839766 20.9055 0.634766 20.5467 0.634766H5.88921C5.53047 0.634766 5.22297 0.788516 5.01797 1.09602L0.251715 7.65602C-0.055785 8.06602 -0.00453502 8.62977 0.354215 8.98852L12.4492 22.006C12.6542 22.211 12.9105 22.3648 13.218 22.3648C13.5255 22.3648 13.7817 22.2623 13.9867 22.006L26.0817 8.98852C26.4405 8.62977 26.4917 8.06602 26.1842 7.65602ZM8.09297 9.34727L10.6555 16.9835L3.58297 9.34727H8.09297ZM14.1917 2.78727L15.9855 7.24602H10.4505L12.2442 2.78727H14.1917ZM16.088 9.34727L13.218 17.9573L10.348 9.34727H16.088ZM18.343 9.34727H22.853L15.7805 16.9835L18.343 9.34727ZM23.2117 7.19477H18.2917L16.498 2.78727H19.983L23.2117 7.19477ZM6.40172 2.78727H9.88671L8.09297 7.24602H3.22422L6.40172 2.78727Z"
                                            class="svg-path" />
                                    </svg>
                                </div>
                                <h4>التعاون</h4>
                                <p>نهدف إلى تقديم محتوى مخصص يتماشى مع مختلف اهتمامات المستخدمين. عبر تخصيص البرامج والموارد
                                    بناءً على
                                    اهتماماتهم الشخصية </p>
                            </div>
                        </div>
                        <div class="col-lg-6 col-md-6 col-12 values">
                            <div class="value">
                                <div class="mb-3">
                                    <svg width="35" height="35" viewBox="0 0 27 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.1842 7.65602L21.418 1.09602C21.213 0.839766 20.9055 0.634766 20.5467 0.634766H5.88921C5.53047 0.634766 5.22297 0.788516 5.01797 1.09602L0.251715 7.65602C-0.055785 8.06602 -0.00453502 8.62977 0.354215 8.98852L12.4492 22.006C12.6542 22.211 12.9105 22.3648 13.218 22.3648C13.5255 22.3648 13.7817 22.2623 13.9867 22.006L26.0817 8.98852C26.4405 8.62977 26.4917 8.06602 26.1842 7.65602ZM8.09297 9.34727L10.6555 16.9835L3.58297 9.34727H8.09297ZM14.1917 2.78727L15.9855 7.24602H10.4505L12.2442 2.78727H14.1917ZM16.088 9.34727L13.218 17.9573L10.348 9.34727H16.088ZM18.343 9.34727H22.853L15.7805 16.9835L18.343 9.34727ZM23.2117 7.19477H18.2917L16.498 2.78727H19.983L23.2117 7.19477ZM6.40172 2.78727H9.88671L8.09297 7.24602H3.22422L6.40172 2.78727Z"
                                            class="svg-path" />
                                    </svg>
                                </div>
                                <h4>الاحترام</h4>
                                <p>أن نيسر حوار طبي بناءً مبني على الاحترام المتبادل بين أفراد المجتمع الصحي السوري أينما
                                    كانوا</p>
                            </div>
                            <div class="value">
                                <div class="mb-3">
                                    <svg width="35" height="35" viewBox="0 0 27 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M26.1842 7.65602L21.418 1.09602C21.213 0.839766 20.9055 0.634766 20.5467 0.634766H5.88921C5.53047 0.634766 5.22297 0.788516 5.01797 1.09602L0.251715 7.65602C-0.055785 8.06602 -0.00453502 8.62977 0.354215 8.98852L12.4492 22.006C12.6542 22.211 12.9105 22.3648 13.218 22.3648C13.5255 22.3648 13.7817 22.2623 13.9867 22.006L26.0817 8.98852C26.4405 8.62977 26.4917 8.06602 26.1842 7.65602ZM8.09297 9.34727L10.6555 16.9835L3.58297 9.34727H8.09297ZM14.1917 2.78727L15.9855 7.24602H10.4505L12.2442 2.78727H14.1917ZM16.088 9.34727L13.218 17.9573L10.348 9.34727H16.088ZM18.343 9.34727H22.853L15.7805 16.9835L18.343 9.34727ZM23.2117 7.19477H18.2917L16.498 2.78727H19.983L23.2117 7.19477ZM6.40172 2.78727H9.88671L8.09297 7.24602H3.22422L6.40172 2.78727Z"
                                            class="svg-path" />
                                    </svg>
                                </div>
                                <h4>النوعية</h4>
                                <p>أن نسعى لتوفير محتوى علمي عالي النوعية، من خلال شراكاتنا مع مؤسسات أكاديمية معترف بها
                                    وأفراد متخصصين في
                                    مجال التعليم الطبي.
                                </p>
                            </div>
                        </div>
                    </div>
                </div>
                <div class="col-lg-5 col-12 mb-4 mb-lg-0 d-flex align-items-center justify-content-center box-img">
                    <img src={{ url('frontend/assets/images/Values_we_believe.png') }} class="img-fluid mb-3"
                        alt="">
                </div>
            </div>
        </div>
    </section>
    <!-- END values-->


@endsection
@section('scripts')
@endsection
